# 🛳️ Using ML To Predict Which Passeners Surrvived The Titanic Shipwreck!

## Problem Defination
"what sorts of people were more likely to survive?” using passenger data (ie name, age, gender, socio-economic class, etc). 

## Data
> The Data For This Project was taken from :- https://www.kaggle.com/competitions/titanic/data
* train.csv contains the training data for the model
* test.csv contains the testing data on which the model is to be tested
* gender_submission.csv is the format in which the predictions are to be submitted to Kaggle

## Evaluation
The evaluation metric for this model is *accuracy*
> For More Information, Check Out :- https://www.kaggle.com/competitions/titanic/overview/evaluation

In [2]:
import pandas as pd
import numpy as np

In [55]:
df = pd.read_csv('titanic/train.csv')
df.head().T

,0,1,2,3,4
PassengerId,1,2,3,4,5
Survived,0,1,1,1,0
Pclass,3,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry"
Sex,male,female,female,female,male
Age,22.0,38.0,26.0,35.0,35.0
SibSp,1,1,0,1,0
Parch,0,0,0,0,0
Ticket,A/5 21171,PC 17599,STON/O2. 3101282,113803,373450
Fare,7.25,71.2833,7.925,53.1,8.05
Cabin,NaN,C85,NaN,C123,NaN
Embarked,S,C,S,S,S

In [11]:
df.size

10692

In [12]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Cleaning The Data

In [56]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
def clean_data(df):
    df['Age'].fillna(df['Age'].median(), inplace=True)
    df.dropna(subset=['Embarked'], inplace=True)
    df.dropna(subset=['Cabin'], inplace=True)
    return df

In [59]:
train_df_clean = clean_data(df)
train_df_clean.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [60]:
train_df_clean.to_csv('titanic/train_clean.csv', index=False)

## Encoding The Data

Many features in this dataset are in text format. Hence, they need to be converted to numerical format before proceeding.

In [3]:
train_df_clean = pd.read_csv('titanic/train_clean.csv')

In [4]:
train_df_clean.head().T

,0,1,2,3,4
PassengerId,2,4,7,11,12
Survived,1,1,0,1,1
Pclass,1,1,1,3,1
Name,"Cumings, Mrs. John Bradley (Florence Briggs Th...","Futrelle, Mrs. Jacques Heath (Lily May Peel)","McCarthy, Mr. Timothy J","Sandstrom, Miss. Marguerite Rut","Bonnell, Miss. Elizabeth"
Sex,female,female,male,female,female
Age,38.0,35.0,54.0,4.0,58.0
SibSp,1,1,0,1,0
Parch,0,0,0,1,0
Ticket,PC 17599,113803,17463,PP 9549,113783
Fare,71.2833,53.1,51.8625,16.7,26.55
Cabin,C85,C123,E46,G6,C103
Embarked,C,S,S,S,S

In [5]:
train_df_clean.drop('Name', axis=1, inplace=True)

In [6]:
train_df_clean.head().T

                    0       1        2        3       4
PassengerId         2       4        7       11      12
Survived            1       1        0        1       1
Pclass              1       1        1        3       1
Sex            female  female     male   female  female
Age              38.0    35.0     54.0      4.0    58.0
SibSp               1       1        0        1       0
Parch               0       0        0        1       0
Ticket       PC 17599  113803    17463  PP 9549  113783
Fare          71.2833    53.1  51.8625     16.7   26.55
Cabin             C85    C123      E46       G6    C103
Embarked            C       S        S        S       S

In [7]:
# Features to be converted - Sex, Ticket, Cabin, Embarked
from sklearn.preprocessing import OrdinalEncoder

encoder = OrdinalEncoder()

train_df_clean[['Sex', 'Ticket', 'Cabin', 'Embarked']] = encoder.fit_transform(train_df_clean[['Sex', 'Ticket', 'Cabin', 'Embarked']])

In [8]:
train_df_clean.head().T

                    0     1         2      3      4
PassengerId    2.0000   4.0    7.0000   11.0  12.00
Survived       1.0000   1.0    0.0000    1.0   1.00
Pclass         1.0000   1.0    1.0000    3.0   1.00
Sex            0.0000   0.0    1.0000    0.0   0.00
Age           38.0000  35.0   54.0000    4.0  58.00
SibSp          1.0000   1.0    0.0000    1.0   0.00
Parch          0.0000   0.0    0.0000    1.0   0.00
Ticket       123.0000  36.0   62.0000  134.0  31.00
Fare          71.2833  53.1   51.8625   16.7  26.55
Cabin         80.0000  54.0  128.0000  144.0  48.00
Embarked       0.0000   2.0    2.0000    2.0   2.00

In [9]:
train_df_clean['Embarked'].value_counts()

2.0    129
0.0     69
1.0      4
Name: Embarked, dtype: int64

In [11]:
train_df_clean['Survived'].value_counts()

1    134
0     68
Name: Survived, dtype: int64

In [73]:
train_df_clean.corr()['Survived']

PassengerId    0.111985
Survived       1.000000
Pclass        -0.030513
Sex           -0.545297
Age           -0.228967
SibSp          0.138202
Parch          0.042456
Ticket         0.062549
Fare           0.128261
Cabin          0.038628
Embarked      -0.130910
Name: Survived, dtype: float64

## Modelling The Data

In [12]:
# taking only those features which have a +ve correlation with the target variable

X = train_df_clean[['PassengerId', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin']]
y = train_df_clean['Survived']

In [13]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [14]:
# using a basic Logistic Regressor model

from sklearn.linear_model import LogisticRegression

logreg = LogisticRegression()

logreg.fit(X_train, y_train)

LogisticRegression()

In [18]:
from sklearn.metrics import classification_report

logistic_y_preds = logreg.predict(X_test)

print(classification_report(y_test, logistic_y_preds))

              precision    recall  f1-score   support

           0       0.00      0.00      0.00        22
           1       0.64      1.00      0.78        39

    accuracy                           0.64        61
   macro avg       0.32      0.50      0.39        61
weighted avg       0.41      0.64      0.50        61

c:\Users\MSI\AppData\Local\Programs\Python\Python37\lib\site-packages\sklearn\metrics\_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\MSI\AppData\Local\Programs\Python\Python37\lib\site-packages\sklearn\metrics\_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\MSI\AppData\Local\Programs\Python\Python37\lib\site-packages\sklearn\metrics\_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [19]:
# pulling out the big guns
from sklearn.ensemble import RandomForestClassifier

model = RandomForestClassifier()

model.fit(X_train, y_train)

RandomForestClassifier()

In [21]:
rf_y_preds = model.predict(X_test)

print(classification_report(y_test, rf_y_preds))

              precision    recall  f1-score   support

           0       1.00      1.00      1.00        22
           1       1.00      1.00      1.00        39

    accuracy                           1.00        61
   macro avg       1.00      1.00      1.00        61
weighted avg       1.00      1.00      1.00        61

In [22]:
y_preds = model.predict(X)

print(classification_report(y, y_preds))

              precision    recall  f1-score   support

           0       0.63      0.54      0.58        68
           1       0.78      0.84      0.81       134

    accuracy                           0.74       202
   macro avg       0.71      0.69      0.70       202
weighted avg       0.73      0.74      0.73       202

In [23]:
X.shape

(202, 6)

In [25]:
train_df_clean

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,0.0,38.0,1,0,123.0,71.2833,80.0,0.0
1,4,1,1,0.0,35.0,1,0,36.0,53.1000,54.0,2.0
2,7,0,1,1.0,54.0,0,0,62.0,51.8625,128.0,2.0
3,11,1,3,0.0,4.0,1,1,134.0,16.7000,144.0,2.0
4,12,1,1,0.0,58.0,0,0,31.0,26.5500,48.0,2.0
...,...,...,...,...,...,...,...,...,...,...,...
197,872,1,1,0.0,47.0,1,1,38.0,52.5542,101.0,2.0
198,873,0,1,1.0,33.0,0,0,102.0,5.0000,33.0,2.0
199,880,1,1,0.0,56.0,0,1,43.0,83.1583,69.0,0.0
200,888,1,1,0.0,19.0,0,0,10.0,30.0000,29.0,2.0
201,890,1,1,1.0,26.0,0,0,8.0,30.0000,59.0,0.0

## Making Predictions on Test csv File

In [26]:
test_df = pd.read_csv('titanic/test.csv')
test_df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [27]:
from sklearn.ensemble import RandomForestClassifier

model = RandomForestClassifier()

model.fit(X, y)

RandomForestClassifier()

In [30]:
test_clean = clean_data(test_df)

In [32]:
test_clean.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [33]:
test_clean.drop('Name', axis=1, inplace=True)

In [47]:
test_clean.shape

(91, 10)

In [35]:
# Features to be converted - Sex, Ticket, Cabin, Embarked
from sklearn.preprocessing import OrdinalEncoder

encoder = OrdinalEncoder()

test_clean[['Sex', 'Ticket', 'Cabin', 'Embarked']] = encoder.fit_transform(test_clean[['Sex', 'Ticket', 'Cabin', 'Embarked']])

In [41]:
X = test_clean[['PassengerId', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin']]

In [46]:
X.shape

(91, 6)

In [43]:
y_preds = model.predict(X)

In [44]:
predicted_dict = {
    "PassengetId": test_clean['PassengerId'],
    "Survived": y_preds
}

predicted_df = pd.DataFrame(predicted_dict)

In [45]:
predicted_df

     PassengetId  Survived
12           904         1
14           906         1
24           916         1
26           918         1
28           920         1
..           ...       ...
404         1296         1
405         1297         1
407         1299         1
411         1303         1
414         1306         1

[91 rows x 2 columns]

## Redoing Everything - Because I'm An Idiot.

In [2]:
import numpy as np
import pandas as pd

In [18]:
training_df = pd.read_csv("titanic/train.csv")
training_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
testing_df = pd.read_csv('titanic/test.csv')
testing_df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [6]:
training_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
from sklearn.preprocessing import OrdinalEncoder

def encodeData(df):
    encoder = OrdinalEncoder()
    df[['Sex', 'Ticket', 'Cabin', 'Embarked']] = encoder.fit_transform(df[['Sex', 'Ticket', 'Cabin', 'Embarked']])
    return df

In [22]:
training_df = encodeData(training_df)

In [23]:
training_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1.0,22.0,1,0,523.0,7.2500,NaN,2.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0.0,38.0,1,0,596.0,71.2833,81.0,0.0
2,3,1,3,"Heikkinen, Miss. Laina",0.0,26.0,0,0,669.0,7.9250,NaN,2.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0.0,35.0,1,0,49.0,53.1000,55.0,2.0
4,5,0,3,"Allen, Mr. William Henry",1.0,35.0,0,0,472.0,8.0500,NaN,2.0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1.0,27.0,0,0,101.0,13.0000,NaN,2.0
887,888,1,1,"Graham, Miss. Margaret Edith",0.0,19.0,0,0,14.0,30.0000,30.0,2.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0.0,NaN,1,2,675.0,23.4500,NaN,2.0
889,890,1,1,"Behr, Mr. Karl Howell",1.0,26.0,0,0,8.0,30.0000,60.0,0.0
890,891,0,3,"Dooley, Mr. Patrick",1.0,32.0,0,0,466.0,7.7500,NaN,1.0

In [24]:
X = training_df[['PassengerId', 'SibSp', 'Parch', 'Ticket', 'Fare']]
y = training_df['Survived']

In [26]:
from sklearn.ensemble import RandomForestClassifier

model = RandomForestClassifier()

model.fit(X, y)

RandomForestClassifier()

In [34]:
testing_df['Fare'].fillna(testing_df['Fare'].median(), inplace=True)

In [35]:
testing_df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [36]:
testing_df = encodeData(testing_df)

In [37]:
test_X = testing_df[['PassengerId', 'SibSp', 'Parch', 'Ticket', 'Fare']]

In [38]:
test_y_preds = model.predict(test_X)

In [39]:
submission_dict = {
    "PassengerId": testing_df['PassengerId'],
    "Survived": test_y_preds
}

submission_df = pd.DataFrame(submission_dict)

submission_df

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [41]:
submission_df.to_csv('titanic/submission1KshipraJadav.csv', index=False)

# Kaggle Score For Above Prediction - 0.6676 ~= 66%